Repository: AshanDon/Story-Book
Catalog: Story Book/com.example.storyBook.supporting/*.lproj/Localizable.strings
Languages: si

# SOCIAL_MEDIA_TITLE
source: Follow us on
si: අපව අනුගමනය කරන්න

# USER_NAME_OR_EMAIL
source: Email
si: විද්‍යුත් තැපෑල

source: Password
si: මුරපදය

# SIGNINBUTTON
source: SignIn
si: පිවිසී​ම

# SIGNUPBUTTON
source: SignUp
si: ලියාපදිංචි​ය

# ORLABEL
source: or
si: හෝ

# EMPTY_USERNAME_TEXT_FIELD
source: Please enter a user name or email.
si: කරුණාකර පරිශීලක නමක් හෝ විද්‍යුත් ලිපියක් ඇතුළත් කරන්න.

# EMPTY_PASSWORD_TEXT_FIELD
source: Please enter a password.
si: කරුණාකර මුරපදයක් ඇතුළත් කරන්න.

# TITLE_OF_SIGNUP_PAGE
source: Sign Up
si: ලියාපදිංචි​ය

source: First Name
si: මුල් නම

source: Last Name
si: අවසන් නම

source: Email
si: විද්යුත් තැපෑල

source: Date of Birth
si: උපන්දිනය

source: Country
si: උපන් රට

source: Retype Password
si: මුරපදය නැවත

# SIGNUP_BUTTON
source: Sign Up
si: ලියාපදිංචි වන්න

# EMPTY_FIRSTNAME_FIELD
source: Your first name is required.
si: ඔබේ මුල් නම අවශ්‍යයි.

# EMPTY_LASTNAME_FIELD
source: Your last name is required.
si: ඔබගේ අවසාන නම අවශ්‍යයි.

# EMPTY_EMAIL_FIELD
source: Your valid email is required.
si: ඔබගේ වලංගු විද්‍යුත් තැපෑල අවශ්‍ය වේ.

# EMPTY_BIRTHDAY_FIELD
source: Your date of birth is required.
si: ඔබගේ උපන් දිනය අවශ්‍ය වේ.

# EMPTY_COUNTRY_FIELD
source: Your country is required.
si: ඔබේ රට අවශ්‍යයි.

# EMPTY_PASSWORD_FIELD
source: Please enter a valid password.
si: කරුණාකර වලංගු මුරපදයක් ඇතුළත් කරන්න.

# EMPTY_RETYPEPASSWORD_FIELD
source: Please re-enter a password.
si: කරුණාකර මුරපදයක් නැවත ඇතුළත් කරන්න.

# TITLE_PHOTO
source: Photo
si: ඡායාරූප

# TITLE_VIDEO
source: Video
si: වීඩියෝ

# NEWPOST_TITLE
source: New Post
si: නව සටහන

source: Write a caption...
si: පෝස්ට් එකේ කතාවක් ලියන්න

source: Tag People
si: මිතුරන් එකතු කරන්න

source: Add Location
si: ස්ථානය එක් කරන්න

# ADD_STORY
source: Add to Story
si: මතකයන් එකතු කරන්න

# HOME_TITLE
source: Home
si: මුල් පිටුව

# MEDIA_TITLE
source: Media
si: ප්‍රකාශන මාධ්‍ය

# NOTIFICATION_TITLE
source: Notification
si: දැනුම්දීම

# CHATLIST_TITLE
source: Chat List
si: කතාබස් ලැයිස්තුව

# CHATLIST_SEARCH
source: Search
si: සෙවීම

source: Location
si: ස්ථානය

# OK_ALERT
source: Ok
si: හරි

source: Warning.
si: අවවාදයයි.

# CANCEL_BUTTON
source: Cancel
si: අවලංගු කරන්න

# NEXT_BUTTON
source: Next
si: ඊලඟ

# BACK_BUTTON
source: Back
si: ආපසු

# SHARE_BUTTON
source: Share
si: පළ කරන්න

# LIBRARY_OPTION
source: Import from Library
si: ඡායාරූප තෝරන්න

# TAKEPHOTO_OPTION
source: Take Photo
si: ඡායාරූපය ගන්න

source: Cancel Upload
si: අවලංගු කරන්න

# DONE_BARBUTTON_ITEM
source: Done
si: ඉවරයි

# CANCEL_BARBUTTON_ITEM
source: Cancel
si: අවලංගු කරන්න

# POST_LABEL
source: Post
si: පළ කිරිම්

# FOLLOWER_LABEL
source: Followers
si: අනුගාමිකයන්

# FOLLOWING_LABEL
source: Following
si: අනුගමනය

# PASSWORD_NOT_MATCH
source: Your password doesn't match.
si: ඔබගේ මුරපදය නොගැලපේ.

# SIGNIN_ERROR_TITLE
source: SignIn Error
si: පිවිසී​මේ දෝෂයකි

# SIGNIN_ERROR_MESSAGE
source: There was a problem logging in
si: පිවිසී​මේ ගැටලුවක් විය.

# SIGNIN_INVALID_EMAIL
source: Invalid Email
si: අවලංගු විද්යුත් ලිපිනකි

# SIGNIN_INVALIDEMAIL_MESSAGE
source: Please enter a valid email or user name.
si: කරුණාකර වලංගු විද්‍යුත් තැපෑලක් හෝ පරිශීලක නාමයක් ඇතුළත් කරන්න.

# SIGNIN_WRONG_PASSWORD
source: Wrong Password
si: වැරදි මුරපදයකි

# SIGNIN_WRONGPASSWORD_MESSAGE
source: The password you entered is wrong.
si: ඔබ ඇතුළත් කළ මුරපදය වැරදිය.

# SIGNUP_ERROR_TITLE
source: SignUp Error
si: ලියාපදිංචි වීමේ දෝෂයකි

# SIGNUP_ERROR_MESSAGE
source: There was a problem signing up
si: ලියාපදිංචි වීමේ දෝෂයකි

# SIGNUP_ALREADY_EMAIL
source: Email Already in user
si: විද්‍යුත් තැපෑල දැනටමත් පරිශීලකයා තුළ ඇත

# SIGNUP_ALREADYEMAIL_MESSAGE
source: Please provide a different email.
si: කරුණාකර වෙනත් විද්‍යුත් තැපෑලක් ලබා දෙන්න.

# SIGNUP_WEAK_PASSWORD
source: Weak Password
si: දුර්වල මුරපදයකී

# SIGNUP_WEAKPASSWORD_MESSAGE
source: Password must be at least 6 characters
si: මුරපදය අවම වශයෙන් අක්ෂර 6 ක් විය යුතුය

# CHANGE_PROFILE_TITLE
source: Change Profile
si: ඔබගේ ඡායාරූපය වෙනස් කරන්න

# CHANGE_PROFILE_MESSAGE
source: Choose an option to change your profile photo.
si: ඔබගේ ඡායාරූපය වෙනස් කිරීමට විකල්පයක් තෝරන්න.

# UPLOADED_ERROR_TITLE
source: Uploaded Error
si: පද්ධතිය​ දෝෂයකි

# UPLOADED_ERROR_MESSAGE
source: There was a problam uploading the image.
si: ඡායාරූපය පද්ධතිය​ට එක් කිරීමේ ගැටලුවක් විය.
